# Homebrew Brewfile
# Automatically maintained with: brew bundle dump
# Install with: brew bundle
# Sync with: ./update.sh (automatic) or: brew bundle dump --file=Brewfile --force


# System Essentials
brew "git"
brew "gcc"
brew "tmux"

# CLI Tools
brew "eza"
brew "bat"
brew "fzf"
brew "tree"
brew "zoxide"
brew "starship"
brew "ripgrep"
brew "fd"

# Development Tools
brew "asdf"

# Ai
brew "opencod"

# Applications - Development & IDEs
cask "cursor"
cask "visual-studio-code"
cask "jetbrains-toolbox"
cask "docker"
cask "utm"

cask "cleanmymac"

# Applications - Terminal
cask "ghostty"

# Applications - Productivity
cask "raycast"
cask "keymapp"
cask "obsidian"
cask "notion"
cask "notion-calendar"

# Applications - Communication
cask "discord"
cask "slack"

# Applications - Design
cask "figma"

# Applications - Browser
cask "arc"
cask "thebrowsercompany-dia"

# Fonts
cask "font-daddy-time-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
