# shell & core
brew "git"
brew "make"
brew "starship"
brew "tmux"
brew "tree"
brew "zsh"

# cli
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "zoxide"

# dev & ide
brew "asdf"
cask "docker-desktop"
cask "github"
cask "gitkraken"
cask "jetbrains-toolbox"
cask "utm"

# terminal
cask "ghostty"
cask "kitty"
cask "warp"

# productivity
cask "keymapp"
cask "notion"
cask "notion-calendar"
cask "obsidian"
cask "raycast"

# browser
cask "firefox"
cask "thebrowsercompany-dia"

# communication
cask "discord"
cask "slack"

# design
cask "figma"

# utilities
cask "cleanmymac"

# Fonts
cask "font-daddy-time-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
