# System Essentials
brew "git"
brew "tmux"
brew "zsh"
brew "bash"
brew "gnupg"

# CLI Tools
brew "eza"
brew "bat"
brew "fzf"
brew "tree"
brew "zoxide"
brew "starship"
brew "ripgrep"
brew "fd"
brew "xz"

# Development Tools
brew "asdf"
cask "docker-desktop"
brew "ansible"
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/packer"
cask "vagrant"

# Ai
tap "anomalyco/tap"
brew "anomalyco/tap/opencode"
cask "opencode-desktop"

# Applications - Development & IDEs
cask "visual-studio-code"
cask "jetbrains-toolbox"
cask "gitkraken"
cask "github"
cask "utm"

cask "cleanmymac"

# Applications - Terminal
cask "ghostty"
cask "warp"
cask "wezterm"
cask "kitty"

# Applications - Productivity
cask "raycast"
cask "keymapp"
cask "obsidian"
cask "notion"
cask "notion-calendar"

# Applications - Communication
cask "discord"
cask "slack"

# Applications - Design
cask "figma"

# Applications - Browser
cask "arc"
cask "thebrowsercompany-dia"
cask "firefox"
cask "google-chrome"

# Fonts
cask "font-daddy-time-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"


# Jeux
cask "steam"