# shell & core
brew "git"
brew "tmux"
brew "zsh"
brew "bash"
brew "bash-completion@2"
brew "starship"
brew "tree"
brew "eza"
brew "zoxide"
brew "fzf"
brew "bat"
brew "mise"

# CLI tools
brew "make"
brew "fd"
brew "ripgrep"
brew "lazygit"
brew "btop"
brew "jq"
brew "gnupg"

# terminal
cask "ghostty"
cask "kitty"

# Tools Dev
cask "jetbrains-toolbox"
cask "gitkraken"
cask "docker-desktop"   # engine + CLI (the `docker` formula is CLI-only)

# productivity
cask "raycast"
cask "keymapp"
cask "obsidian"

# browser
cask "firefox"
cask "google-chrome"